Repository: SiroDevs/SongLib-Flutter
Catalog: l10n/app_*.arb
Languages: sw

# listTitle
source: Song Lists
sw: Orodha za Nyimbo

# searchTitle
source: Search Songs
sw: Tafuta Nyimbo

# likesTitle
source: Liked Songs
sw: Zilizopendwa

# historiesTitle
source: Histories
sw: Historia

# draftTitle
source: Song Drafts
sw: Nyimbo Zangu

# settingsTitle
source: Settings
sw: Mipangilio

# helpdeskTitle
source: Help Desk
sw: Usaidizi

# donateTitle
source: How to Donate
sw: Jinsi ya Kuchanga

# merchandiseTitle
source: Buy our Merchandise
sw: Nunua bidhaa zetu

# booksTitle
source: Select Song Books
sw: Chagua Vitabu

# booksTitleLoading
source: Loading data ...
sw: Inapakia data ...

# homeTitle
source: Home
sw: Nyumbani

# listedTitle
source: Adding a new list
sw: Kuongezea orodha mpya

# editorTitle
source: Drafting a new song
sw: Kunakili wimbo mpya

# songTitle
source: Your song in one line
sw: Jina la Wimbo

# songText
source: The rest of your song
sw: Maneno ya Wimbo

# addtoList
source: Add to a List
sw: Ongeza kwa orodha

# addSongtoList
source: Add this song to a List
sw: Ongeza wimbo kwa orodha

# likeSong
source: Like this song
sw: Penda wimbo huu

# editSong
source: Edit this song
sw: Hariri wimbo huu

# deleteSong
source: Delete this song
sw: Futa wimbo huu

# copySong
source: Copy this song
sw: Nakili wimbo huu

# deleteList
source: Delete this list
sw: Futa orodha hii

# shareSong
source: Share this song
sw: Shiriki wimbo huu

source: song copied!
sw: wimbo umenakiliwa!

source: Copy verse
sw: Nakili verse

# textCopied
source: copied!
sw: umenakiliwa!

source: Share verse
sw: Shiriki verse

# songLiked
source: Song added to Favorites!
sw: umependwa!

# songAddedToList
source: added to
sw: umeongezwa kwa

# listCreated
source: song list created!
sw: orodha ya nyimbo imebuniwa!

# listUpdated
source: song list updated!
sw: orodha ya nyimbo imehaririwa!

source: deleted!
sw: imefutwa!

# readyShare
source: Ready for sharing
sw: Tayari kwa kushiriki

# screenshoted
source: We have your screenshot!
sw: Tunayo screenshot yako!

source: Choose Theme
sw: Chagua Mwonekano

# themeLight
source: Light
sw: Angavu

# themeDark
source: Dark
sw: Giza

source: Okay
sw: SAWA

source: Cancel
sw: GHAIRI

# remind
source: Remind Me Later
sw: NIKUMBUSHE BAADAYE ME

source: Donate
sw: CHANGIA SASA

source: Proceed
sw: ENDELEA

source: Just a minute!
sw: Hebu kidogo!

# notificationDialog
source: Let's remind you
sw: Hebu tukukumbushe

source: Donation Request
sw: Ombi la kuchangisha

# donationRequestBody
source: SongLib has a lot in the pipelines and will need your support to accomplish that.
sw: SongLib ina mengi katika bomba na itahitaji usaidizi wako ili kutimiza hilo.

# doneSelecting
source: Done with selecting?
sw: Umemaliza kuchagua?

# doneSelectingBody
source: If you are done selecting please proceed ahead. We can always bring you back here to reselect afresh.
sw: Kama umemaliza kuchagua tafadhali endelea mbele. Tunaweza kukurudisha hapa kila wakati ili uchague upya.

# noSelection
source: Oops! No selection found
sw: Lo! Hakuna uteuzi uliopatikana

# noSelectionBody
source: Please select at least 1 book to proceed to the next step.
sw: Tafadhali chagua angalau kitabu 1 ili kuendelea na hatua inayofuata.

# errorOccurred
source: Wueh! You weren't supposed to see this!
sw: Wueh! Hukupaswa kuona hili!

# errorOccurredBody1
source: An unexpected error occurred while trying to present the song to you. Please try again later or contact support
sw: Hitilafu isiyotarajiwa ilitokea wakati wa kujaribu kuwasilisha wimbo kwako. Tafadhali jaribu tena baadaye au wasiliana na usaidizi

# errorOccurredBody
source: An unexpected error occurred while trying to fetch data from the server. Please try again later or contact support
sw: Hitilafu isiyotarajiwa ilitokea wakati wa kujaribu kuleta data kutoka kwa seva. Tafadhali jaribu tena baadaye au wasiliana na usaidizi

# noConnection
source: No internet connection!
sw: Hamna muunganisho wa mtandao!

# noConnectionBody
source: If you have reliable internet connection, then it's our servers that are down or unaccessible. If this situation persists, email us: futuristicken@gmail.com with a screenshot and your device info.
sw: Iwapo una muunganisho wa mtandao imara, basi ni seva zetu ambazo hazipatikani. Ikiwa hali hii itaendelea, tutumie barua pepe: futuristicken@gmail.com na picha ya skrini na maelezo ya kifaa chako.

# itsEmptyHere
source: Wueh! It's empty here
sw: Wueh! Ni kutupu hapa

# itsEmptyHere1
source: Wueh! No lists here yet
sw: Wueh! Bado hamna orodha hapa

# itsEmptyHereBody
source: All caught here, do a selection of songs once again
sw: Hamna chochote hapa, fanya uteuzi wa nyimbo kwa mara nyingine tena

# itsEmptyHereBody1
source: All caught here, please like a song, search or view a song or better still add a custom list to clear this emptiness here
sw: Hamna chochote hapa, tafadhali penda wimbo, tafuta au tazama wimbo au bora zaidi ongeza orodha maalum ili kufuta utupu huu hapa

# itsEmptyHereBody2
source: All caught here, please add draft song to clear this emptiness here
sw: Hamna chochote hapa, tafadhali ongeza wimbo ili kuondoa utupu huu hapa

# itsEmptyHereBody3
source: All caught here, please like a song to clear this emptiness here
sw: WHamna chochote hapa, tafadhali kama wimbo ili kuondoa utupu huu hapa

# itsEmptyHereBody4
source: All caught here, you can add personal lists and add songs to them
sw: Hamna chochote hapa, unaweza kuongeza orodha za kibinafsi na kuziongeza nyimbo

source: Keyboard Shortcuts
sw: Njia za mkato za kibodi

# keyboardShortcutsTexts
source: Letter I - Show keyboard shortcuts ESC Key - Exit from Song Presentation DOWN Arrow - Go to Next Verse UP Arrow - Go to Previous Verse Letter C - Go to the Song Chorus Letter S - Go to Second Last Verse Letter L - Go to Last Verse Numpad 1, 2, 3, 4, 5, 6, 7 - Go to the Verse by Number
sw: Herufi I - Onyesha mikato ya kibodi ESC Key - Toka kwenye Wasilisho la Wimbo Mshale wa CHINI - Nenda kwa Mstari Ufuatao Kishale cha JUU - Nenda kwa Mstari Uliotangulia Herufi C - Nenda kwenye Pambio ya Wimbo Barua S - Nenda kwa Mstari wa Pili Toka Mwisho Herufi L - Nenda kwa Mstari wa Mwisho Nambari 1, 2, 3, 4, 5, 6, 7 - Nenda kwa Mstari kwa Nambari

source: Disabled
sw: Zima

source: Enabled
sw: Wezesha

# verticalSlide
source: Vertical (Up, Down)
sw: Juu Chini

# horizontalSlide
source: Horizontal (Left, Right)
sw: Kushoto Kulia

# songbooksMgnt
source: Songbooks Management
sw: Mipangilio za Vitabu

# songbooksMgntText
source: Reselect your songbooks afresh
sw: Chagua vitabu upya

# screenAwake
source: Keep Screen On in Song View
sw: Skrini isizime kwenye Presentation ya Wimbo

# slideDirection
source: Song Slides Direction
sw: Upande wa Slides za Nyimbo

# setDirection
source: Direction: {direction}
sw: Upande: {direction}

# setTheme
source: Theme: {theme}
sw: Mwonekano: {theme}

# lightMode
source: Light
sw: Angavu

# darkMode
source: Dark
sw: Giza
